{
    "en": {
        "PROFILE_BIRTH": "Date of Birth",
        "PROFILE_ZIP": "Zip Code",
        "PROFILE_GENDER": "Gender",
        "PROFILE_EDUCATION": "Education",
        "PROFILE_INCOME": "Income",
        "PROFILE_FREQUENCY": "How frequent visits UGS",
        "PROFILE_TIMEOFDAY": "Time of the day with more visits to UGS",
        "PROFILE_TIMEOFWEEK": "Time of the week with more visits to UGS",
        "PROFILE_TRANSPORTATION": "Means of transportation used to visit UGS",
        "PROFILE_LOADING": "Loading profile...",
        "RESULTS_ABOUT_UGS": "Your opinion about the UGS",
        "RESULTS_ANIMAL": "Animal elements",
        "RESULTS_ANIMAL_OTHER": "Other animal elements",
        "RESULTS_VEGETATION": "Vegetation elements",
        "RESULTS_VEGETATION_OTHER": "Other vegetation elements",
        "RESULTS_MANMADE": "Man made elements",
        "RESULTS_MANMADE_OTHER": "Other man made elements",
        "RESULTS_MOTIVATION": "Motivation",
        "RESULTS_MOTIVATION_OTHER": "Other motivation",
        "RESULTS_FEELING": "How you felt",
        "RESULTS_ANSWERS_TITLE": "Answers",
        "RESULTS_MARKERS_TITLE": "Markers",
        "OAUTH_LOGIN": "Login with",
        "OAUTH_REGISTER": "Register w/",
        "LOGIN_ERROR": "Something went wrong with the login.",
        "REGISTER_ERROR": "Something went wrong with the registration.",
        "OTHER": "other",
        "WELCOME": "Generic Crowdsourcing System for Dynamic Evironmental Surveys. To map Urban Green Spaces while assessing urban dewellers preferences within these spaces.",
        "BACK": "Back",
        "EDIT": "Edit",
        "SUBMIT": "Submit",
        "WARNING": "WARNING",
        "MARKERS_WARNING": "Your markers list is empty this may happen if you placed marker outside UGS or in newly added UGS.",
        "POINTS": "Points",
        "LOADING_SURVEY": "Loading survey, please wait...",
        "FAIL_SURVEY": "Unable to load survey. Please go back.",
        "USABILITY_FORM": "Usability Form",
        "PRESENTATION": {
            "PAGE": {
                "1": {
                    "TITLE": "Welcome to the Urban Green Spaces (UGS) usage mapping app.",
                    "TEXT": {
                        "1": "This app was developed in the context of a master's thesis from Instituto Superior Técnico in collaboration with the Faculdade de Ciências da Universidade de Lisboa. The objective of this app is to collect data regarding the UGS use and users’ preferences. Every piece of collected information will be used for scientific purposes only, allowing researchers to understand the motivations behind users behaviours  and support UGS planning and management. At the moment the database only has UGS in Lisbon. Here you can find a brief tutorial explaining how to use the app. After using the app help improve it by giving your feedback about its usability. Fill the form by clicking the button bellow."
                    },
                    "IMAGE" : {}
                },
                "2": {
                    "TITLE": "Profile",
                    "TEXT": {
                        "1": "In the profile section is requested some information about you. This data is important because it will help researchers to better interpret and contextualize your answers. All the information shown in this screen will be visible only to you and the researchers team, no other user will have access to this data. The profile screen can be divided into two main parts. The first part regards your basic user information, used to identify you. Here you have the section marked as 1 where your ranking within the app will be displayed, in section 2 you will see your profile information such as profile photo, name, user type (normal or researcher) and your email. Finally, you will be able to edit this information at any time by using the button marked with 3.",
                        "2": "After entering in the editing mode (by clicking in the editing button) you will be presented with the screen below. Section 4 and 5 allow you to change your profile photo and name respectively, all these changes will only have effect when you save the data, i.e., when button 6 is pressed.",
                        "3": "The second part of the profile screen (section 7) contains  information that will be used to understand who visits UGS and people’s motivations. This section can be edited by clicking tin botton 8.",
                        "4": "After filling the survey do not forget to press the submit button (section 9) in order to save your answers."
                    },
                    "IMAGE" : {
                        "1": {
                            "WIDTH": "1080",
                            "HEIGHT": "1206"
                        },
                        "2": {
                            "WIDTH": "1080",
                            "HEIGHT": "1372"
                        },
                        "3": {
                            "WIDTH": "1080",
                            "HEIGHT": "1748"
                        },
                        "4": {
                            "WIDTH": "1080",
                            "HEIGHT": "308"
                        }
                    }
                },
                "3": {
                    "TITLE": "Survey",
                    "TEXT": {
                        "1": "The survey screen is the main screen in the app. Because it is here where you, the user, will be able to share with the researchers' team your opinion about the UGS. The answers given in these surveys are the reason for the existence of this app, so we asked you to answer as honestly and thoughtfully as possible. This screen is divided into two sub-screens. The form screen can be accessed by pressing the button in section 1.",
                        "2": "The form screen consists of a map where the user can see its geographical position as well as the UGS marked in the map with a green circumference as shown in section 2. In the screen, there will also appear different questions (section 3) to which you must answer in order to complete the survey. There is also a button that allows you to change the map layout you wish to see (section 4).",
                        "3": "By clicking in the button in section 5 you will be redirected to the mapping sub screen. This screen is also dedicated to the collection of data about UGS. But this time the user is asked to mark relevant places inside each UGS. These markers can either be associated with the user’s feeling, the weather or UGS elements.",
                        "4": "The screen contains a map similar to the one presented before but, this time, with several marked places like shown in section 6. Below (section 7) are the buttons that must be pressed in order to mark a specific place."
                    },
                    "IMAGE" : {
                        "1": {
                            "WIDTH": "1080",
                            "HEIGHT": "291"
                        },
                        "2": {
                            "WIDTH": "1080",
                            "HEIGHT": "1940"
                        },
                        "3": {
                            "WIDTH": "1080",
                            "HEIGHT": "284"
                        },
                        "4": {
                            "WIDTH": "1080",
                            "HEIGHT": "2260"
                        }
                    }
                },
                "4": {
                    "TITLE": "Results",
                    "TEXT": {
                        "1": "The results screen is where the user can find both the given answers and the placed markers. It is structured similarly to the survey screen. By pressing the button in section 1 the user is taken to the answers list.",
                        "2": "Here (section 2) is presented a list of clickable cards containing the information about the different answers given so far.",
                        "3": "After clicking on any of the available cards it is displayed  detailed information, as it is shown in the section 3. Button 4 allows you to go back to the answers list.",
                        "4": "The button in section 5 redirects to a list of UGS. This list contains all the UGS where the user placed any marker.",
                        "5": "Each UGS will be represented by a clickable card as before and demonstrated in section 6.",
                        "6": "By clicking in one of the mentioned UGS cards, it will lead you to a screen containing a list of all the markers placed in that UGS. In this screen it is also possible to see the details about each individual marker. Equivalently to the answers detail screen here there is also a back button to return to the UGS list."
                    },
                    "IMAGE" : {
                        "1": {
                            "WIDTH": "1080",
                            "HEIGHT": "292"
                        },
                        "2": {
                            "WIDTH": "1080",
                            "HEIGHT": "1956"
                        },
                        "3": {
                            "WIDTH": "1080",
                            "HEIGHT": "2220"
                        },
                        "4": {
                            "WIDTH": "1080",
                            "HEIGHT": "282"
                        },
                        "5": {
                            "WIDTH": "1080",
                            "HEIGHT": "729"
                        },
                        "6": {
                            "WIDTH": "1080",
                            "HEIGHT": "2262"
                        }
                    }
                }
            }
        }
    },
    "pt": {
        "PROFILE_BIRTH": "Data de Nascimento",
        "PROFILE_ZIP": "Código Postal",
        "PROFILE_GENDER": "Género",
        "PROFILE_EDUCATION": "Educação",
        "PROFILE_INCOME": "Vencimento",
        "PROFILE_FREQUENCY": "Frequência com que visita espaços verdes",
        "PROFILE_TIMEOFDAY": "Altura do dia em que mais visita espaços verdes",
        "PROFILE_TIMEOFWEEK": "Altura da semana em que mais visita espaços verdes",
        "PROFILE_TRANSPORTATION": "Principais meios de transporte usados para visitar espaços verdes",
        "PROFILE_LOADING": "A carregar perfil...",
        "RESULTS_ABOUT_UGS": "A sua opinião acerca deste espaço verde",
        "RESULTS_ANIMAL": "Animais encontrados",
        "RESULTS_ANIMAL_OTHER": "Outros animais",
        "RESULTS_VEGETATION": "Vegetação encontrada",
        "RESULTS_VEGETATION_OTHER": "Outros tipos de vegetação",
        "RESULTS_MANMADE": "Mobiliário urbano",
        "RESULTS_MANMADE_OTHER": "Outros elementos de mobiliário urbano",
        "RESULTS_MOTIVATION": "Motivação",
        "RESULTS_MOTIVATION_OTHER": "Outra motivação",
        "RESULTS_FEELING": "Como se sentiu",
        "RESULTS_ANSWERS_TITLE": "Respostas",
        "RESULTS_MARKERS_TITLE": "Pontos de Interesse",
        "OAUTH_LOGIN": "Entrar com",
        "OAUTH_REGISTER": "Registar c/",
        "LOGIN_ERROR": "Algo correu mal com o login.",
        "REGISTER_ERROR": "Algo correu mal com o registo.",
        "OTHER": "outro",
        "WELCOME": "Sistema Genérico de Crowdsourcing para a criação de Questionários Ambientais Dinâmicos. Para mapear Espaços Verdes Urbanos enquanto se aferem as preferências dos visitantes destes espaços.",
        "BACK": "Voltar",
        "EDIT": "Editar",
        "SUBMIT": "Submeter",
        "WARNING": "AVISO",
        "MARKERS_WARNING": "A sua lista de pontos de interesse está vazia isto pode acontecer se identificou pontos fora de espaços verdes ou em espaços verdes recentemente adicionados.",
        "POINTS": "Pontos",
        "LOADING_SURVEY": "A carregar questionário por favor aguarde...",
        "FAIL_SURVEY": "Não foi possível carregar o survey. Por favor volte ao menu.",
        "USABILITY_FORM": "Questionário de Usabilidade",
        "PRESENTATION": {
            "PAGE": {
                "1": {
                    "TITLE": "Bem-vindo(a) à aplicação de mapeamento de usos de Espaços Verdes Urbanos (EVU).",
                    "TEXT": {
                        "1": "Esta app foi desenvolvida no contexto de uma tese de mestrado do Instituto Superior Técnico em colaboração com a Faculdade de Ciências da Universidade de Lisboa. O objectivo desta app é recolher informações sobre a utilização de Espaços Verdes Urbano (em inglês, Urban Green Spaces ou UGS) por parte dos utilizadores bem como as suas preferências. Todas as informações recolhidas serão apenas utilizadas para fins científicos, permitindo aos investigadores perceber as motivações por trás do comportamento dos usuários e apoiar o planeamento e gestão dos EVU. Neste momento a base de dados apenas contém EVU situados na cidade Lisboa. Aqui encontra-se um breve tutorial de como utilizar correctamente a app. Após utitlizar a app ajude a melhorá-la deixanto a sua opinião à cerca da sua usabilidade. Preencha o questionário clicando no botão em baixo."
                    },
                    "IMAGE" : {}
                },
                "2": {
                    "TITLE": "Perfil",
                    "TEXT": {
                        "1": "No perfil são pedidas algumas informações pessoais. Esta informação é importante porque ajudará os investigadores a interpretar e contextualizar as suas respostas. Toda a informação presente neste ecrã apenas será visível por si e pela equipa de investigadores, nenhum outro utilizador terá acesso a esta informação. O ecrã de perfil pode ser dividido em duas partes. A primeira é referente à informação básica do utilizador, usada apenas para a sua identificação. Aqui, na secção marcada com o número 1 será apresentado o seu ranking dentro da app. Na secção 2 será visível os seus dados pessoais tais como a sua foto de perfil, nome, tipo de utilizador (normal ou investigador) e o seu endereço de email. Finalmente, o botão na secção 3 permite-lhe editar esta informação.",
                        "2": "Após entrar no modo de edição (clicando no botão de editar) ser-lhe-á apresentado o seguinte ecrã. As secções 4 e 5 permitem mudar a foto de perfil e o nome respectivamente. Todas estas alterações, apenas se tornarão permanentes quando for clicado o botão 6.",
                        "3": "A segunda parte do ecrã do perfil (secção 7), contém  informação que será então usada pelos investigadores para entender quem visita os EVU e quais as suas motivações. Ao clicar no botão 8 poderá editar esta secção.",
                        "4": "Após o preenchimento do formulário não se esqueça de pressionar o botão (na secção 9) para submeter e guardar as suas respostas."
                    },
                    "IMAGE" : {
                        "1": {
                            "WIDTH": "1080",
                            "HEIGHT": "1206"
                        },
                        "2": {
                            "WIDTH": "1080",
                            "HEIGHT": "1372"
                        },
                        "3": {
                            "WIDTH": "1080",
                            "HEIGHT": "1748"
                        },
                        "4": {
                            "WIDTH": "1080",
                            "HEIGHT": "308"
                        }
                    }
                },
                "3": {
                    "TITLE": "Questionário",
                    "TEXT": {
                        "1": "O ecrã do questionário é o principal da aplicação. É através deste ecrã que o utilizador poderá partilhar com a equipa de investigadores a sua opinião sobre os EVU. As respostas dadas aos questionários que serão apresentados neste ecrã são a motivação por detrás desta aplicação, como tal é lhe pedido que as suas respostas sejam o mais honestas e o melhor pensadas possível. Este ecrã divide-se em dois sub-ecrãs. O ecrã dos questionários pode ser acedido clicando no botão na secção 1.",
                        "2": "O ecrã dos questionários consiste num mapa onde o utilizador pode ver a sua posição geográfica actual bem como os EVU, que se encontram marcados no mapa com uma circunferência verde, tal como demonstrado na secção 2. No ecrã também irão aparecer diferentes questões (secção 3), que deverão ser respondidas para completar o questionário. Existe ainda um botão que permite alterar o tipo de mapa que deseja visualizar (secção 4).",
                        "3": "Ao clicar no botão da secção 5 será redirecionado para o sub ecrã de mapeamento. Este ecrã também é dedicado à recolha de dados sobre EVU. Desta vez é pedido ao utilizador para marcar lugares relevantes dentro de cada espaço verde. Este marcadores podem reflectir as motivações do utilizador, condições meteorológicas ou elementos dentro do EVU.",
                        "4": "O ecrã contém um mapa semelhante ao apresentado anteriormente mas aqui serão apresentados os vários pontos de interesse assinalados, como se vê na secção 6. Em baixo (secção 7) estão os botões que quando clicados permitem assinalar os pontos de interesse."
                    },
                    "IMAGE" : {
                        "1": {
                            "WIDTH": "1080",
                            "HEIGHT": "291"
                        },
                        "2": {
                            "WIDTH": "1080",
                            "HEIGHT": "1940"
                        },
                        "3": {
                            "WIDTH": "1080",
                            "HEIGHT": "284"
                        },
                        "4": {
                            "WIDTH": "1080",
                            "HEIGHT": "2260"
                        }
                    }
                },
                "4": {
                    "TITLE": "Resultados",
                    "TEXT": {
                        "1": "O ecrã dos resultados é onde o utilizador pode encontrar tanto as respostas dadas aos questionário como os pontos de interesse assinalados. Encontra-se estruturado da mesma forma que o ecrã dos questionários. Ao clicar no botão da secção 1 o utilizador é levado para a lista das suas respostas.",
                        "2": "Aqui (secção 2) é apresentada uma lista de cartões clicáveis que contêm a descrição sobre as diferentes respostas dadas até agora.",
                        "3": "Após clicar em algum dos cartões disponíveis, são apresentados os detalhes sobre a resposta à qual o cartão diz respeito,  como demonstrado na secção 3. O botão 4 permite retroceder e voltar à lista de respostas.",
                        "4": "O botão na secção 5 redireciona para uma lista de espaços verdes. Esta lista contém todos os espaços verdes onde o utilizador assinalou algum ponto de interesse.",
                        "5": "Cada EVU será representado por um cartão clicável tal como antes e à semelhança do demonstrado na secção 6.",
                        "6": "Ao clicar em um dos cartões mencionados levará o utilizador para um ecrã contendo uma lista com todos os pontos de interesse assinalados dentro do respectivo espaço verde. Neste ecrã também são visíveis os detalhes sobre cada marcador individual. À semelhança do ecrã onde eram apresentados os detalhes das respostas, também neste ecrã existe um botão que permite regressar à lista de EVU."
                    },
                    "IMAGE" : {
                        "1": {
                            "WIDTH": "1080",
                            "HEIGHT": "292"
                        },
                        "2": {
                            "WIDTH": "1080",
                            "HEIGHT": "1956"
                        },
                        "3": {
                            "WIDTH": "1080",
                            "HEIGHT": "2220"
                        },
                        "4": {
                            "WIDTH": "1080",
                            "HEIGHT": "282"
                        },
                        "5": {
                            "WIDTH": "1080",
                            "HEIGHT": "729"
                        },
                        "6": {
                            "WIDTH": "1080",
                            "HEIGHT": "2262"
                        }
                    }
                }
            }
        }
    }
}